КонКонф/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТрудоваяИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

КонКонф/Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	Перем ТекстСообщения;
	ТекстСообщения = "";
	Если ПустаяСтрока(Объект.Фамилия) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Фамилия";
	КонецЕсли;
	Если ПустаяСтрока(Объект.Имя) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Имя";
	КонецЕсли; 
	Если ПустаяСтрока(Объект.Отчество) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Отчество";
	КонецЕсли;
	Если Объект.Оклад = 0 Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Оклад";
	КонецЕсли;
	Если Не ПустаяСтрока(ТекстСообщения) Тогда 
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Объект.Наименование = Объект.Фамилия + " " + ВРег(Лев(Объект.Имя, 1)) + "." + ВРег(Лев(Объект.Отчество, 1)) +".";
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	// Вставить содержимое обработчика.
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда 
		Фото = ПутьФайла;
		УстановитьКартинку();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку()
	НовыйФайлКартинки = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайлКартинки.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	Фото = ПоместитьВоВременноеХранилище(НовыйФайлКартинки.Файл.Получить());
	НовыйФайлКартинки.Записать();
	Объект.Картинка = НовыйФайлКартинки.Ссылка;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры
